v2206/solver_ADMFoam/multi_bubbleComparison/icoReactingMultiphaseInterFoam/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.fluid    1.0
    volScalarFieldValue alpha.air      0.0 
);

regions
(
    boxToCell
    {
        box (0 -0.04 0) (1 0.00 1);
        fieldValues
        (
            volScalarFieldValue alpha.fluid     0.0
            volScalarFieldValue alpha.air       1.0  
        );
    }

    sphereToCell
    {
        centre (0.02 -0.14 0.0001);
        radius 0.003;
        fieldValues
        (
            volScalarFieldValue alpha.fluid     0.0
            volScalarFieldValue alpha.air       1.0
        );
    }
);


// ************************************************************************* //
